{
  "id": "eu-mifid-crd-2024-001",
  "title": "MiFID II Capital Requirements Directive - Investment Firms",
  "jurisdiction": "EU",
  "source_system": "demo",
  "effective_date": "2024-01-10",
  "source_url": "https://eur-lex.europa.eu/legal-content/EN/TXT/?uri=CELEX:32024R0001",
  "document_type": "directive",
  "regulatory_authority": "European Securities and Markets Authority",
  "body": "REGULATION (EU) 2024/001 - CAPITAL REQUIREMENTS FOR INVESTMENT FIRMS\n\nArticle 11 - Own funds requirements\n\n1. MINIMUM CAPITAL REQUIREMENTS:\n\nInvestment firms shall at all times satisfy the following own funds requirements:\n\n(a) Class 1 firms (dealing on own account, underwriting): EUR 750,000\n(b) Class 2 firms (portfolio management, investment advice): EUR 125,000  \n(c) Class 3 firms (reception and transmission of orders): EUR 50,000\n\n2. CAPITAL ADEQUACY:\n\nThe total capital ratio shall be at least 8% of the total risk exposure amount. The Common Equity Tier 1 capital ratio shall be at least 4.5% of the total risk exposure amount.\n\n3. K-FACTOR REQUIREMENTS:\n\nInvestment firms must calculate capital requirements based on K-factors:\n\n(a) K-AUM (Assets Under Management): 0.02% of AUM\n(b) K-COH (Client Orders Handled): EUR 0.1 per EUR 1 million of orders\n(c) K-DTF (Daily Trading Flow): 0.1% of daily average trading flow\n(d) K-NPR (Net Position Risk): Based on sensitivity method in Annex III\n(e) K-CMH (Client Money Held): 0.4% of total client money held\n\n4. LIQUIDITY REQUIREMENTS:\n\nInvestment firms shall maintain liquid assets equivalent to at least one-third of their fixed overheads of the preceding year. Liquid assets must include:\n- Cash or cash equivalents: minimum 50%\n- Government bonds (AAA to A-): maximum 30%  \n- Corporate bonds (investment grade): maximum 20%\n\n5. CONCENTRATION LIMITS:\n\nExposures to a single client or group of connected clients shall not exceed 25% of the firm's eligible capital. For exposures to credit institutions, the limit is 100% of eligible capital.\n\n6. INTERNAL CAPITAL ADEQUACY ASSESSMENT PROCESS (ICAAP):\n\nFirms must maintain an ICAAP that:\n- Identifies material risks\n- Quantifies capital needs\n- Is reviewed annually by senior management\n- Is subject to supervisory review and evaluation\n\n7. REPORTING OBLIGATIONS:\n\nInvestment firms shall submit:\n- Quarterly prudential reporting (COREP templates) within 30 days\n- Annual audited financial statements within 4 months\n- Ad-hoc breach notifications within 24 hours\n\n8. SUPERVISORY POWERS:\n\nCompetent authorities may:\n- Require higher capital ratios (Pillar 2 add-ons)\n- Impose restrictions on distributions\n- Require additional liquidity buffers\n- Suspend or withdraw authorisation\n\n9. TRANSITIONAL PROVISIONS:\n\nExisting investment firms have 12 months from the date of entry into force to comply with the new requirements. During the transitional period, previous CRD IV requirements continue to apply.\n\n10. PENALTIES:\n\nMember States shall ensure that breaches are subject to:\n- Administrative sanctions up to EUR 5,000,000 or 10% of annual turnover\n- Public warnings and statements\n- Suspension of voting rights\n- Temporary ban on management responsibilities\n\nThis Regulation shall enter into force on the twentieth day following publication in the Official Journal of the European Union."
}
