{
  "id": "sec-capital-req-2024-001",
  "title": "SEC Net Capital Requirements for Broker-Dealers",
  "jurisdiction": "US",
  "source_system": "demo",
  "effective_date": "2024-01-15",
  "source_url": "https://www.sec.gov/rules/final/2024/capital-requirements.pdf",
  "document_type": "regulation",
  "regulatory_authority": "Securities and Exchange Commission",
  "body": "SECURITIES AND EXCHANGE COMMISSION - NET CAPITAL REQUIREMENTS FOR BROKER-DEALERS\n\nยง 240.15c3-1 Net capital requirements for brokers or dealers.\n\nEvery broker or dealer must at all times have and maintain net capital in an amount not less than the greatest of the following:\n\n(a) MINIMUM NET CAPITAL: Every broker-dealer shall maintain minimum net capital of $250,000. For firms carrying customer accounts, the minimum shall be $1,000,000.\n\n(b) CAPITAL ADEQUACY RATIO: Broker-dealers must maintain a capital adequacy ratio of at least 8% of risk-weighted assets. The ratio must be calculated using the aggregate debit balances of customer accounts.\n\n(c) LIQUIDITY REQUIREMENTS: Firms shall maintain liquid assets equal to at least 120% of total liabilities. Liquid assets include cash, U.S. Treasury securities, and investment-grade corporate bonds.\n\n(d) HAIRCUTS ON PROPRIETARY POSITIONS:\n- Equity securities: 15% of market value\n- Investment-grade debt: 2% of market value\n- High-yield debt: 8% of market value\n- Derivatives: Per Schedule A\n\n(e) EARLY WARNING THRESHOLDS: A broker-dealer must notify the Commission if:\n- Net capital falls below 120% of minimum requirement\n- Aggregate indebtedness exceeds 1200% of net capital\n- Capital adequacy ratio falls below 10%\n\n(f) CUSTOMER PROTECTION: Firms carrying customer accounts must compute a reserve requirement daily and maintain a Special Reserve Bank Account for the Exclusive Benefit of Customers under 17 CFR 240.15c3-3.\n\n(g) CONCENTRATION LIMITS: No broker-dealer shall have exposure to any single counterparty exceeding 25% of its net capital without prior approval.\n\n(h) STRESS TESTING: Firms with net capital exceeding $500 million must conduct quarterly stress tests covering:\n- Market risk scenarios\n- Credit risk scenarios\n- Liquidity stress scenarios\n\n(i) REPORTING: Monthly FOCUS Report filings are required within 17 business days of month-end. Annual audited financials must be filed within 60 days of fiscal year-end.\n\n(j) SANCTIONS: Failure to maintain required net capital is a violation of Section 15(c)(3) of the Securities Exchange Act and may result in:\n- Suspension of operations\n- Revocation of broker-dealer registration\n- Civil monetary penalties up to $1,000,000 per violation\n- Criminal prosecution under 15 U.S.C. ยง 78ff\n\nThis rule shall be effective 60 days after publication in the Federal Register."
}
